app/controllers/plants_controller.rb

INSERT INTO "plants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "VIdeira"], ["created_at", "2018-12-08 15:19:12.511517"], ["updated_at", "2018-12-08 15:19:12.511517"]]
---
  def create
    @plant = Plant.new(plant_params)

    if @plant.save

UPDATE "plants" SET "name" = $1, "updated_at" = $2 WHERE "plants"."id" = $3  [["name", "Videira"], ["updated_at", "2018-12-08 15:19:17.915091"], ["id", 1]]
---
  def update
    if @plant.update(plant_params)

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_plant
      @plant = Plant.find(params[:id])