app/controllers/situations_controller.rb

SELECT "situations".* FROM "situations"
---
  def index
    @situations = Situation.all